In [10]:
import pandas as pd
data = [["Fernando", 39, 4000], ["Jhon", 45, 4600],
        ["Ellen", 21, 1900], ["Mary", 54, 91000]]
df = pd.DataFrame(data=data, columns=["Name", "Age", "Balance in Banks"])
df

       Name  Age  Balance in Banks
0  Fernando   39              4000
1      Jhon   45              4600
2     Ellen   21              1900
3      Mary   54             91000

In [12]:
type(df), type(df["Age"])

(pandas.core.frame.DataFrame, pandas.core.series.Series)

In [13]:
df.shape # show the number of rows and columns

(4, 3)

In [14]:
df.info # returns info about dataframe

<bound method DataFrame.info of        Name  Age  Balance in Banks
0  Fernando   39              4000
1      Jhon   45              4600
2     Ellen   21              1900
3      Mary   54             91000>

In [15]:
df['Name'] # return a series of names

0    Fernando
1        Jhon
2       Ellen
3        Mary
Name: Name, dtype: object

In [16]:
df.Name # Another posibility for obtain a column

0    Fernando
1        Jhon
2       Ellen
3        Mary
Name: Name, dtype: object

In [17]:
df.Age

0    39
1    45
2    21
3    54
Name: Age, dtype: int64

In [24]:
# We can add a colum as follow:

df["Phone Number"] = ['30025691', '30125896', '30025963', '']

In [25]:
df

       Name  Age  Balance in Banks Phone Number
0  Fernando   39              4000     30025691
1      Jhon   45              4600     30125896
2     Ellen   21              1900     30025963
3      Mary   54             91000

We can drop (return a secci√≥n of the dataframe) without an section

In [30]:
df.drop(2,0)

       Name  Age  Balance in Banks Phone Number
0  Fernando   39              4000     30025691
1      Jhon   45              4600     30125896
3      Mary   54             91000

In [28]:
df.drop("Phone Number", axis=1) # axis 1 indicates "Column", axis 0 indicates "row"

       Name  Age  Balance in Banks
0  Fernando   39              4000
1      Jhon   45              4600
2     Ellen   21              1900
3      Mary   54             91000

In [29]:
df # The data frame orginal is unchanged

       Name  Age  Balance in Banks Phone Number
0  Fernando   39              4000     30025691
1      Jhon   45              4600     30125896
2     Ellen   21              1900     30025963
3      Mary   54             91000

We can modify the dataframe if we pass the attribute "inplace" with the value Ture

In [32]:
df.drop("Phone Number", axis=1, inplace=True)

In [37]:
df

       Name  Age  Balance in Banks
0  Fernando   39              4000
1      Jhon   45              4600
2     Ellen   21              1900
3      Mary   54             91000

We can rename columns too:

In [39]:
df.rename(columns={"Name": "First Name", "Age" : "Age", "Balance in Banks": "Balance" }, inplace=True)
df

  First Name  Age  Balance
0   Fernando   39     4000
1       Jhon   45     4600
2      Ellen   21     1900
3       Mary   54    91000

Another way to rename columns is

In [40]:
df.columns = {"NAME", "AGE", "BALANCE"}
df

        AGE  NAME  BALANCE
0  Fernando    39     4000
1      Jhon    45     4600
2     Ellen    21     1900
3      Mary    54    91000